# DATA GROUPING
---

The table below shows the number of visits to a certain online store and the number of products purchased.

Day | Browser | Visits | Purchase
----|---------|--------|---------
Monday | Edge | 15 | 3
Monday | Chrome | 17 | 1
Monday | Safari | 11 | 2
Friday | Edge | 10 | 2
Friday | Safari | 23 | 7
Sunday | Chrome | 34 | 12

In [341]:
import pandas as pd
visits_data = {
    'Day':['Monday','Monday','Monday','Friday','Friday','Sunday'],
    'Browser':['Edge','Chrome','Safari','Edge','Safari','Chrome'],
    'Visits':[15,17,11,10,23,34],
    'Purchase':[3,1,2,2,7,12]
    }
visits = pd.DataFrame(visits_data)
visits

      Day Browser  Visits  Purchase
0  Monday    Edge      15         3
1  Monday  Chrome      17         1
2  Monday  Safari      11         2
3  Friday    Edge      10         2
4  Friday  Safari      23         7
5  Sunday  Chrome      34        12

To calculate and display the total number of visits on individual days of the week, specify the result columns, the columns by which the data are grouped and the aggregation function:

In [342]:
visits.loc[:,['Day','Visits']].groupby(['Day']).sum()

        Visits
Day
Friday      33
Monday      43
Sunday      34

If you also want to calculate the total of products purchased for each week, add the column name 'Purchase' to the list of result columns.

In [343]:
visits.loc[:,['Day','Visits','Purchase']].groupby(['Day']).sum()

        Visits  Purchase
Day
Friday      33         9
Monday      43         6
Sunday      34        12

### Tasks

Calculate and display the average number of website visits by day of the week, depending on the web browser.

In [344]:
visits.loc[:,['Day','Visits','Browser']].groupby(['Browser','Day']).sum()

                Visits
Browser Day
Chrome  Monday      17
        Sunday      34
Edge    Friday      10
        Monday      15
Safari  Friday      23
        Monday      11

Calculate and display the number of web browsers used on specific days of the week.

In [345]:
visits.loc[:,['Day','Browser']].groupby(['Day']).count()

        Browser
Day
Friday        2
Monday        3
Sunday        1

Calculate and display the number of web browsers used on specific days of the week. Sort the results in descending order.

In [346]:
visits.loc[:,['Day','Browser']].groupby(['Day']).count().sort_values(by='Browser', ascending=False)

        Browser
Day
Monday        3
Friday        2
Sunday        1

The 'employees.csv' file contains data of employees of one of the IT companies. Display employee list. Then, calculate and display:

1. Number of women and men
1. Number of employees by country
1. Number of women and men by country
1. Average age of employees

In [347]:
data = pd.read_csv('employees.csv')
data.loc[:,['sex','first_name']].groupby(['sex']).count()

        first_name
sex
Female           7
Male            13

In [348]:
data.loc[:,['first_name','country']].groupby(['country']).count()

                first_name
country
Czech Republic          11
Poland                   8
United Kingdom           1

In [349]:
data.loc[:,['first_name','sex','country']].groupby(['country','sex']).count()

                       first_name
country        sex
Czech Republic Female           3
               Male             8
Poland         Female           4
               Male             4
United Kingdom Male             1

In [350]:
data['age'].mean()

45.15

1. Average age of women and men

In [351]:
data.loc[:,['first_name','sex','age']].groupby(['sex']).mean('Age')

              age
sex
Female  38.428571
Male    48.769231

1. Average salary in the company.
1. Average salary of women and men

In [352]:
data['salary'].mean()

73804.416

In [353]:
data.loc[:,['first_name','sex','salary']].groupby(['sex']).mean('salary')

              salary
sex
Female  82115.781429
Male    69329.065385

1. Minimum age of women and men by country. Sort the results in descending order.
1. Median salary of women and men by country.
1. Median salary of women and men by country. Save the results to a csv file.

In [354]:
data.loc[:,['sex','country','age']].groupby(['country']).min('age').sort_values(by="age",ascending=False)

                age
country
United Kingdom   37
Czech Republic   20
Poland           19

In [355]:
data.loc[:,['sex','country','salary']].groupby(['sex','country']).median('salary')

                           salary
sex    country
Female Czech Republic   44973.700
       Poland          107833.315
Male   Czech Republic   57259.410
       Poland           72688.560
       United Kingdom  148308.960

In [356]:
data.loc[:,['sex','country','salary']].groupby(['sex','country']).median('salary').to_csv('median.csv')